---
kind: property
id: P:Autodesk.Revit.DB.Mesh.NumTriangles
source: html/8b73d0a2-4390-7866-61c9-ee44eaa21c8b.htm
---
# Autodesk.Revit.DB.Mesh.NumTriangles Property

The number of triangles that the mesh contains.

## Syntax (C#)
```csharp
public int NumTriangles { get; }
```